core/app/Http/Controllers/SiteController.php

select * from `pages` where `name` = 'home' limit 1
select * from `plans` where `status` = 1
---
    public function index()
    {

        $pageTitle = 'Home';

        $sections = Page::where('name', 'home')->first();

        if (!$sections) {

            $sections = Page::create([
                'name' => 'home',
                'sections' => ['about'],
                'slug' => 'home',
                'seo_description' => 'home',
                'page_order' => 1
            ]);
        }

        $plan = Plan::where('status', 1)->get();

select * from `pages` where `slug` = 'about' limit 1
---
    public function page(Request $request)
    {

        $page = Page::where('slug', $request->pages)->first();

select * from `plans` where `status` = 1
---
    public function investmentPlan()
    {
        $pageTitle = "Investment Plan";
        $plans = Plan::where('status', 1)->get();

select * from `general_settings` limit 1
select * from `plans` where `plans`.`id` = '14' limit 1
select * from `times` where `times`.`id` in (5)
---
    public function investmentUsingBalannce(Request $request)
    {

        $request->validate([
            'amount' => 'required|numeric'
        ]);

        $general = GeneralSetting::first();

        $plan_id = Plan::with('time')->findOrFail($request->plan_id);

update `users` set `balance` = 0, `users`.`updated_at` = '2023-05-20 11:47:30' where `id` = 5
insert into `payments` (`plan_id`, `gateway_id`, `user_id`, `transaction_id`, `amount`, `rate`, `charge`, `final_amount`, `payment_status`, `next_payment_date`, `updated_at`, `created_at`) values (14, 0, 5, 'LS2RFLREAUAFWKFU', '500', 0, 0, '500', 1, '2023-05-21 11:47:30', '2023-05-20 11:47:30', '2023-05-20 11:47:30')
---
        }

        $user->balance = $user->balance - $request->amount;
        $user->save();

        $deposit = Payment::create([
            'plan_id' => $plan_id->id,
            'gateway_id' => 0,
            'user_id' => auth()->id(),
            'transaction_id' => $trx,
            'amount' => $request->amount,
            'rate' => 0,
            'charge' => 0,
            'final_amount' => $request->amount,
            'payment_status' => 1,
            'next_payment_date' => $next_payment_date,

        ]);

insert into `transactions` (`trx`, `gateway_id`, `amount`, `currency`, `details`, `charge`, `type`, `gateway_transaction`, `user_id`, `payment_status`, `updated_at`, `created_at`) values ('LS2RFLREAUAFWKFU', 0, '500', 'USD', 'Payment Successfull', 0, '-', '', 5, 1, '2023-05-20 11:47:32', '2023-05-20 11:47:32')
---



        Transaction::create([
            'trx' => $deposit->transaction_id,
            'gateway_id' => $deposit->gateway_id,
            'amount' => $deposit->final_amount,
            'currency' => @$general->site_currency,
            'details' => 'Payment Successfull',
            'charge' => 0,
            'type' => '-',
            'gateway_transaction' => '',
            'user_id' => auth()->id(),
            'payment_status' => 1,
        ]);

select * from `plans` where `status` = 1
---
    public function allInvestmentPlan()
    {
        $pageTitle = "Investment Plan";
        $plans = Plan::where('status', 1)->get();

select * from `general_settings` limit 1
select * from `section_data` where `theme` = 4 and `key` = 'blog.element' limit 6 offset 0
select count(*) as aggregate from `section_data` where `theme` = 4 and `key` = 'blog.element'
---
    public function allblog()
    {
        $theme = GeneralSetting::first()->theme;

        $pageTitle = 'Blog';
        $blogs = SectionData::where('theme', $theme)->where('key', 'blog.element')->paginate(6);

select * from `payments` where `user_id` = 3 and `payment_status` = 1 limit 15 offset 0
select count(*) as aggregate from `payments` where `user_id` = 3 and `payment_status` = 1
---
    public function investLog(Request $request)
    {
        $pageTitle = 'Invest Log';

        $transactions = Payment::when($request->trx, function ($item) use ($request) {
            $item->where('transaction_id', $request->trx);
        })->when($request->date, function ($item) use ($request) {
                $item->whereDate('created_at', $request->date);
            })->where('user_id', auth()->id())->where('payment_status', 1)->paginate();