app/Http/Helpers/helpers.php

function filePath($folder_name)
{
    $general = GeneralSetting::first();
---
select * from `general_settings` limit 1

function getFile($folder_name, $filename)
{
    $general = GeneralSetting::first();
---
select * from `general_settings` limit 1

function sendMail($key, array $data, $user)
{

    $general = GeneralSetting::first();

    $template =  EmailTemplate::where('name', $key)->first();
---
select * from `general_settings` limit 1
select * from `email_templates` where `name` = 'Commission' limit 1

function content($key)
{
    $general = GeneralSetting::first();

    return SectionData::where('theme', $general->theme)->where('key', $key)->first();
---
select * from `general_settings` limit 1
select * from `section_data` where `theme` = 4 and `key` = 'contact.content' limit 1

function element($key, $take = 10)
{
    $general = GeneralSetting::first();

    return SectionData::where('theme', $general->theme)->where('key', $key)->take($take)->get();
---
select * from `general_settings` limit 1
select * from `section_data` where `theme` = 4 and `key` = 'footer.element' limit 10

function template()
{
    $general = GeneralSetting::first();
---
select * from `general_settings` limit 1

function refferMoney($id, $user, $refferal_type, $amount, $plan)
{

    $user_id = $id;

    $level = Refferal::where('status', 1)->where('type', $refferal_type)->where('plan_id', $plan)->first();

    $counter = $level ? count($level->level) : 0;

    $general = GeneralSetting::first();

    for ($i = 0; $i < $counter; $i++) {

        if ($user) {

            $comission = ($level->commision[$i] * $amount) / 100;
            $user->balance = $user->balance + $comission;

            $user->save();

            $a = RefferedCommission::create([
                'reffered_by' => $user->id,
                'reffered_to' => $id,
                'commission_from' => $user_id,
                'amount' => $comission,
                'purpouse' => $refferal_type === 'invest' ? 'Return invest commission' : 'Return Interest Commission'

            ]);
---
select * from `general_settings` limit 1
update `users` set `balance` = 10, `users`.`updated_at` = '2023-05-20 11:47:30' where `id` = 4
insert into `reffered_commissions` (`reffered_by`, `reffered_to`, `commission_from`, `amount`, `purpouse`, `updated_at`, `created_at`) values (4, 5, 5, 10, 'Return invest commission', '2023-05-20 11:47:30', '2023-05-20 11:47:30')

function currentPlan($user)
{
    $plan = Payment::with('plan')->where('user_id', $user->id)->where('payment_status', 1)->latest()->first();
---
select * from `payments` where `user_id` = 2 and `payment_status` = 1 order by `created_at` desc limit 1
select * from `plans` where `plans`.`id` in (13)